ОперативныеЗадачиКР/src/Documents/ПоступлениеКомплектующих/ПоступлениеКомплектующих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКомплектующих</name>
  <registerRecords>AccumulationRegister.ОстаткиКомплектующих</registerRecords>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Комплектующая</name>
      <type>
        <types>CatalogRef.Комплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОперативныеЗадачиКР/src/AccumulationRegisters/ОстаткиКомплектующих/ОстаткиКомплектующих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКомплектующих</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Комплектующая</name>
    <type>
      <types>CatalogRef.Комплектующие</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОперативныеЗадачиКР/src/Documents/ПоступлениеКомплектующих/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиКомплектующих Приход
	Движения.ОстаткиКомплектующих.Записывать = Истина;
	Для Каждого ТекСтрокаКомплектующие Из Комплектующие Цикл
		
		Движение = Движения.ОстаткиКомплектующих.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		
		Движение.Комплектующая = ТекСтрокаКомплектующие.Комплектующая;
		
		Движение.Количество = ТекСтрокаКомплектующие.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
